IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_erad_crc_regs.xml
<module id="ERAD_CRC_REGS" HW_revision="" description="ERAD CRC Registers">
	<register id="CRC_CURRENT" width="32" page="1" offset="0x0" internal="0" description="CRC_CURRENT">
		<bitfield id="CRC_CURRENT" description="Current CRC Computed Value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CRC_SEED" width="32" page="1" offset="0x2" internal="0" description="CRC SEED value">
		<bitfield id="CRC_SEED" description="CRC Seed Register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRC_QUALIFIER" width="16" page="1" offset="0x4" internal="0" description="CRC_QUALIFIER">
		<bitfield id="CRC_QUALIFIER" description="CRC Qualifier Register" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
</module>
